Test/risultatiHEY/10000/WasmEdge10000AOT.txt
hey -n 10000 http://0.0.0.0:8080

Summary:
  Total:        1.3585 secs
  Slowest:      0.0275 secs
  Fastest:      0.0005 secs
  Average:      0.0066 secs
  Requests/sec: 7361.2605

  Total data:   60000 bytes
  Size/request: 6 bytes

Response time histogram:
  0.000 [1]     |
  0.003 [273]   |■■
  0.006 [2517]  |■■■■■■■■■■■■■■■
  0.009 [6630]  |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.011 [461]   |■■■
  0.014 [58]    |
  0.017 [21]    |
  0.019 [11]    |
  0.022 [15]    |
  0.025 [8]     |
  0.028 [5]     |


Latency distribution:
  10% in 0.0047 secs
  25% in 0.0057 secs
  50% in 0.0067 secs
  75% in 0.0076 secs
  90% in 0.0083 secs
  95% in 0.0087 secs
  99% in 0.0122 secs

Details (average, fastest, slowest):
  DNS+dialup:   0.0000 secs, 0.0005 secs, 0.0275 secs
  DNS-lookup:   0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:    0.0000 secs, 0.0000 secs, 0.0045 secs
  resp wait:    0.0065 secs, 0.0004 secs, 0.0211 secs
  resp read:    0.0001 secs, 0.0000 secs, 0.0026 secs

Status code distribution:
  [200] 10000 responses